# x = [1,2,3,4,5]
# s = 0
# for number in x:
#     s += number
    
# print(number)
# x = [[1,2], [3,4]]
# s = 0
# for item in x:
#     for number in item:
#         s += number
# print(s)
# تمرین با استفاده از حلقه های فور تو در تو مجموع اعداد موجود در لیست زیر را محاسبه و نمایش دهید
# همچنین مجموع اعداد بزرگتر یا مساوی از سه را نیز محاسبه و نمایش دهید
x = [
    [
        [1,2], 
        [3,4], 
        [4,5,6]
        ], 
    [
        [1,2,3,4], 
        [
            [1,2,3],
            [1,2]
            ]
        ]
    ]
    